Revit 2027 API
EnergyAnalysisMaterial.Density Property
 The density of the material, in kg/(ft^3).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Density { get; }
Public ReadOnly Property Density As Double
	Get
public:
property double Density {
	double get ();
}
member Density : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace